GHB2/src/DataProcessors/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2</name>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоСверять</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоДелать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

GHB2/src/Catalogs/гхб_ФизическиеЛицаБазХолдинга/гхб_ФизическиеЛицаБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛицаБазХолдинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GUIDБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоТекущейБазы</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоменноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СКР_ДляВыплатНаБанк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРусское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетСоответствияВУчетныхБазах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_ФизическиеЛица/гхб_ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ФизЛицаСОшибками</name>
      <description>Физ. лица с ошибками</description>
    </items>
    <items>
      <name>СырыеДанные</name>
      <description>Сырые данные</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/DataProcessors/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2/Forms/ФормаРедактированияФизЛиц/Module.bsl
#Область ДействияФормыЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	таб.Наименование КАК Наименование,
	|	таб.ИНН КАК ИНН,
	|	таб.ПометкаУдаления КАК ПометкаУдаления,
	|	таб.guid КАК guid,
	|	таб.ДоменноеИмя КАК ДоменноеИмя,
	|	таб.Пол КАК Пол,
	|	таб.ДатаРождения КАК ДатаРождения
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Наименование КАК Наименование,
	|	втДанные.ИНН КАК ИНН,
	|	втДанные.guid КАК guid,
	|	втДанные.ПометкаУдаления КАК ПометкаУдаления,
	|	гхб_ФизическиеЛицаБазХолдинга.Ссылка КАК ФизЛицо,
	|	втДанные.ДоменноеИмя КАК ДоменноеИмя,
	|	втДанные.Пол КАК Пол,
	|	втДанные.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	втДанные КАК втДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гхб_ФизическиеЛицаБазХолдинга КАК гхб_ФизическиеЛицаБазХолдинга
	|		ПО втДанные.guid = гхб_ФизическиеЛицаБазХолдинга.GUIDБазыХолдинга
	|			И (гхб_ФизическиеЛицаБазХолдинга.БазаХолдинга = &БазаХолдинга)
	|ГДЕ
	|	(втДанные.Наименование <> гхб_ФизическиеЛицаБазХолдинга.Наименование
	|			ИЛИ втДанные.ПометкаУдаления <> гхб_ФизическиеЛицаБазХолдинга.ПометкаУдаления
	|			ИЛИ втДанные.ИНН <> гхб_ФизическиеЛицаБазХолдинга.ИНН
	|			ИЛИ втДанные.ДоменноеИмя <> гхб_ФизическиеЛицаБазХолдинга.ДоменноеИмя
	|			ИЛИ втДанные.ДатаРождения <> гхб_ФизическиеЛицаБазХолдинга.ДатаРождения
	|			ИЛИ втДанные.Пол <> гхб_ФизическиеЛицаБазХолдинга.Пол)
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанные.Пол,
	|	втДанные.ДатаРождения,
	|	гхб_ФизическиеЛицаБазХолдинга.Ссылка,
	|	втДанные.guid,
	|	втДанные.ДоменноеИмя,
	|	втДанные.Наименование,
	|	втДанные.ПометкаУдаления,
	|	втДанные.ИНН";
	
	Запрос.УстановитьПараметр("таб", Параметры.тзДанные);
	Запрос.УстановитьПараметр("БазаХолдинга", Параметры.БазаХолдинга);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		новСтр = Данные.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Выборка);
		
		Отличия = "";
		
		Если Выборка.Наименование <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "Наименование") Тогда
			Отличия = Отличия + "Наименование" + Символы.ПС;
		КонецЕсли;
		Если Выборка.ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "ПометкаУдаления") Тогда
			Отличия = Отличия + "Пометка удаления" + Символы.ПС;
		КонецЕсли;
		Если Выборка.ИНН <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "ИНН") Тогда
			Отличия = Отличия + "ИНН" + Символы.ПС;
		КонецЕсли;
		Если Выборка.ДоменноеИмя <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "ДоменноеИмя") Тогда
			Отличия = Отличия + "Доменное имя" + Символы.ПС;
		КонецЕсли;
		Если Выборка.ДатаРождения <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "ДатаРождения") Тогда
			Отличия = Отличия + "Дата рождения" + Символы.ПС;
		КонецЕсли;
		Если Выборка.Пол <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ФизЛицо, "Пол") Тогда
			Отличия = Отличия + "Пол" + Символы.ПС;
		КонецЕсли;
		
		новСтр.Отличия = СокрЛП(Отличия);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	Для каждого СтрокаДанные Из Данные Цикл
		СтрокаДанные.ДН = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	Для каждого СтрокаДанные Из Данные Цикл
		СтрокаДанные.ДН = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьДанные(Команда)
	РедактироватьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура РедактироватьДанныеНаСервере()
	
	мНайденное = Данные.НайтиСтроки(Новый Структура("ДН", Истина));
	
	Для каждого СтрокаДанные Из мНайденное Цикл
	
		Если СтрокаДанные.Редактировано Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанные.Редактировано = РедактироватьФизЛицоБазыХолдинга(СтрокаДанные);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция РедактироватьФизЛицоБазыХолдинга(СтрокаДанные)

	Попытка
		
		спрОбъект = СтрокаДанные.ФизЛицо.ПолучитьОбъект();
		спрОбъект.ДополнительныеСвойства.Вставить("ПометкаПришлаОбменом", Истина);
		Если спрОбъект.ИНН <> СтрокаДанные.ИНН Тогда
			
			спрОбъект.ФизЛицоТекущейБазы = ПолучитьФизЛицоТекущейБазы(СтрокаДанные.ИНН);
			спрОбъект.ИНН = СтрокаДанные.ИНН;
			
		КонецЕсли;
		
		Если спрОбъект.Наименование <> СтрокаДанные.Наименование Тогда
			спрОбъект.Наименование = СтрокаДанные.Наименование;
		КонецЕсли;
		
		Если спрОбъект.ПометкаУдаления <> СтрокаДанные.ПометкаУдаления Тогда
			спрОбъект.ПометкаУдаления = СтрокаДанные.ПометкаУдаления;
		КонецЕсли;
		
		Если спрОбъект.ДоменноеИмя <> СтрокаДанные.ДоменноеИмя Тогда
			спрОбъект.ДоменноеИмя = СтрокаДанные.ДоменноеИмя;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанные.Пол) И спрОбъект.Пол <> СтрокаДанные.Пол Тогда
			спрОбъект.Пол = СтрокаДанные.Пол;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанные.ДатаРождения) И спрОбъект.ДатаРождения <> СтрокаДанные.ДатаРождения Тогда
			спрОбъект.ДатаРождения = СтрокаДанные.ДатаРождения;
		КонецЕсли;
		
		спрОбъект.Записать();
		ОбщегоНазначения.СообщитьПользователю("Редактировано " + спрОбъект.Ссылка);
		Возврат Истина;
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;

КонецФункции // РедактироватьФизЛицоБазыХолдинга()

&НаСервере
Функция ПолучитьФизЛицоТекущейБазы(ИНН)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гхб_ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.гхб_ФизическиеЛица КАК гхб_ФизическиеЛица
	|ГДЕ
	|	НЕ гхб_ФизическиеЛица.ЭтоГруппа
	|	И НЕ гхб_ФизическиеЛица.ПометкаУдаления
	|	И гхб_ФизическиеЛица.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьФизЛицоТекущейБазы()

#КонецОбласти
